# Начинаем игру крестики нолики
# Надо написать код, который будет проверять игру двух людей
# Удачи!

def writeln(OF):
    print('  |  0  |  1  |  2  |')
    print('0 | ', OF[0][0], ' | ', OF[0][1], ' | ', OF[0][2], ' |')
    print('1 | ', OF[1][0], ' | ', OF[1][1], ' | ', OF[1][2], ' |')
    print('2 | ', OF[2][0], ' | ', OF[2][1], ' | ', OF[2][2], ' |')


def openfieldX(OF):  #Игра за крестики и проверка
    print('Ходят крестики')
    x = int(input())  # Вводим координаты
    y = int(input())
    if OF[x][y] != ' ':
        print('Не надо жульничать!')
        exit(0)
    else:
        OF[x][y] = 'x'
        writeln(OF)
    if ((OF[0][0] == OF[0][1] == OF[0][2] != ' ')
        or (OF[1][0] == OF[1][1] == OF[1][2] != ' ')
        or (OF[2][0] == OF[2][1] == OF[2][2] != ' ')
        or (OF[0][0] == OF[1][0] == OF[2][0] != ' ')
        or (OF[0][1] == OF[1][1] == OF[2][1] != ' ')
        or (OF[0][2] == OF[1][2] == OF[2][2] != ' ')
        or (OF[0][0] == OF[1][1] == OF[2][2] != ' ')
        or (OF[0][2] == OF[1][1] == OF[2][0] != ' ')):
        print('You WIN, крестик)')
        exit(0)
    return OF


def openfieldO(OF):   #Игра за нолиики и проверка
    print('Ходят нолики')
    x = int(input())  # Вводим координаты
    y = int(input())
    if OF[x][y] != ' ':
        print('Не надо жульничать!')
        exit(0)
    else:
        OF[x][y] = 'o'
        writeln(OF)
    if ((OF[0][0] == OF[0][1] == OF[0][2] != ' ')
        or (OF[1][0] == OF[1][1] == OF[1][2] != ' ')
        or (OF[2][0] == OF[2][1] == OF[2][2] != ' ')
        or (OF[0][0] == OF[1][0] == OF[2][0] != ' ')
        or (OF[0][1] == OF[1][1] == OF[2][1] != ' ')
        or (OF[0][2] == OF[1][2] == OF[2][2] != ' ')
        or (OF[0][0] == OF[1][1] == OF[2][2] != ' ')
        or (OF[0][2] == OF[1][1] == OF[2][0] != ' ')):
        print('You WIN, нолик)')
        exit(0)
    return OF


print('Приветствую в игре крестики-нолики')
print('......Параметры ввода: x, y.......')
print('__________________________________', end='\n')
OFW = [[' ', ' ', ' '], [' ', ' ', ' '], [' ', ' ', ' ']]
writeln(OFW)
i = 0
while True:
    openfieldO(OFW)
    i += 1
    if i == 9: break
    openfieldX(OFW)
    i += 1
print('......Ничья......')
